Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    Serial.println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    Serial.println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif


// ADD THIS: New data structure to send both states together in one package
typedef struct {
    DAP_state_basic_st    basic_st;
    DAP_state_extended_st extended_st;
    bool sendBasicFlag_b;
    bool sendExtendedFlag_b;
} PedalStatePackage_t;

// ADD THIS: The handle for our new FreeRTOS queue
static QueueHandle_t pedalStateQueue = NULL;


void setup()
{
  DAP_config_st dap_config_st_local;

  // ADD THIS: Create the queue before creating the tasks that use it.
  // The queue can hold up to 5 state packages.
  pedalStateQueue = xQueueCreate(5, sizeof(PedalStatePackage_t));
  if (pedalStateQueue == NULL) {
      Serial.println("Error creating the pedal state queue!");
  }

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN
    pinMode(BRAKE_RESISTOR_PIN, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN
    pinMode(EMERGENCY_PIN,INPUT_PULLUP);
  #endif

  #ifdef ANGLE_SENSOR_GPIO

    pinMode(ANGLE_SENSOR_GPIO, INPUT);
    pinMode(ANGLE_SENSOR_GPIO_2, INPUT);
  #endif
  

  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif
  
  #ifdef USING_BUZZER
    Buzzer.initialized(BuzzerPin,1);
    Buzzer.single_beep_tone(770,100);
  #endif

  #if PCB_VERSION == 7
    Serial.setTxTimeoutMs(0);
    Serial.begin(DEFAULTBAUD);
  #else
    #ifdef BAUDRATE3M
      Serial.begin(BAUD3M, SERIAL_8N1);
      Serial.setTxBufferSize(256);
    #else
      Serial.begin(DEFAULTBAUD, SERIAL_8N1);
    #endif
    Serial.setTimeout(5);
  #endif
  parse_version(DAP_FIRMWARE_VERSION, &versionMajor, &versionMinor, &versionPatch);
  Serial.println(" ");
  Serial.println(" ");
  Serial.println(" ");
  //delay(3000);
  Serial.println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  Serial.println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  Serial.print("Board: ");
  Serial.println(CONTROL_BOARD);
  Serial.print("Firmware Version:");
  Serial.println(DAP_FIRMWARE_VERSION);
  //#endif
  #ifdef PRINT_PARTITION_TABLE
    printf("========== Partition Table ==========\n");
    printf("| %-10s | %-4s | %-7s | %-8s | %-8s | %-5s |\n", "Name", "Type", "SubType", "Offset", "Size", "Encrypted");
    printf("--------------------------------------------------------------------------------\n");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        printf("| %-10s | 0x%02x | 0x%02x    | 0x%08x | 0x%08x | %-5s |\n",
               part->label,      
               part->type,       
               part->subtype,    
               part->address,    
               part->size,       
               part->encrypted ? "true" : "false");
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    printf("=====================================\n");
  #endif
  
	#ifdef Hardware_Pairing_button
    pinMode(Pairing_GPIO, INPUT_PULLUP);
  #endif

  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0x00,0x00);
    pixels.show(); 
  #endif

  // Load config from EEPROM, if valid, overwrite initial config
  EEPROM.begin(2048);
  global_dap_config_class.loadConfigFromEprom();
  dap_config_st_local = global_dap_config_class.getConfig();


  // check validity of data from EEPROM  
  bool structChecker = true;
  uint16_t crc;
  if ( dap_config_st_local.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG ){ 
    structChecker = false;
    /*Serial.print("Payload type expected: ");
    Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
    Serial.print(",   Payload type received: ");
    Serial.println(dap_config_st_local.payLoadHeader_.payloadType);*/
  }
  if ( dap_config_st_local.payLoadHeader_.version != DAP_VERSION_CONFIG ){ 
    structChecker = false;
    /*Serial.print("Config version expected: ");
    Serial.print(DAP_VERSION_CONFIG);
    Serial.print(",   Config version received: ");
    Serial.println(dap_config_st_local.payLoadHeader_.version);*/
  }
  // checksum validation
  crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payLoadHeader_)), sizeof(dap_config_st_local.payLoadHeader_) + sizeof(dap_config_st_local.payLoadPedalConfig_));
  if (crc != dap_config_st_local.payloadFooter_.checkSum){ 
    structChecker = false;
    /*Serial.print("CRC expected: ");
    Serial.print(crc);
    Serial.print(",   CRC received: ");
    Serial.println(dap_config_st_local.payloadFooter_.checkSum);*/
  }






  // if checks are successfull, overwrite global configuration struct
  if (structChecker == true)
  {
    Serial.println("Updating pedal config from EEPROM");
    global_dap_config_class.setConfig(dap_config_st_local);
  }
  else
  {

    Serial.println("Couldn't load config from EPROM due to mismatch: ");

    Serial.print("Payload type expected: ");
    Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
    Serial.print(",   Payload type received: ");
    Serial.println(dap_config_st_local.payLoadHeader_.payloadType);

    Serial.print("Target version: ");
    Serial.print(DAP_VERSION_CONFIG);
    Serial.print(",    Source version: ");
    Serial.println(dap_config_st_local.payLoadHeader_.version);

