Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
    Serial.print("CRC expected: ");
    Serial.print(crc);
    Serial.print(",   CRC received: ");
    Serial.println(dap_config_st_local.payloadFooter_.checkSum);
    //if the config check all failed, reinitialzie _config_st
    Serial.println("initialized config");
    global_dap_config_class.initializedConfig();
    dap_config_st_local=global_dap_config_class.getConfig();
  }


  // interprete config values
  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);

  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x5f,0x5f,0x00);//yellow
      pixels.show(); 
      //delay(3000);
  #endif


  bool invMotorDir = dap_config_st_local.payLoadPedalConfig_.invertMotorDirection_u8 > 0;
  stepper = new StepperWithLimits(stepPinStepper, dirPinStepper, invMotorDir, dap_calculationVariables_st.stepsPerMotorRevolution); 

  motorRevolutionsPerSteps_fl32 = 1.0f / ( (float)dap_calculationVariables_st.stepsPerMotorRevolution );
  // Serial.printf("Steps per motor revolution: %d\n", dap_calculationVariables_st.stepsPerMotorRevolution);

  #ifdef USES_ADS1220
    /*  Uses ADS1220 */
    loadcell = new LoadCell_ADS1220();

  #else
    /*  Uses ADS1256 */
    loadcell = new LoadCell_ADS1256();
  #endif

  

  loadcell->setLoadcellRating(dap_config_st_local.payLoadPedalConfig_.loadcell_rating);

  loadcell->estimateBiasAndVariance();       // automatically identify sensor noise for KF parameterization

	// find the min & max endstops
	Serial.println("Start homing");
	stepper->findMinMaxSensorless(dap_config_st_local);

 
  Serial.print("Min Position is "); Serial.println(stepper->getLimitMin());
  Serial.print("Max Position is "); Serial.println(stepper->getLimitMax());


  // setup Kalman filters
  // Serial.print("Given loadcell variance: ");
  // Serial.println(loadcell->getVarianceEstimate(), 5);
  kalman = new KalmanFilter_1st_order(loadcell->getVarianceEstimate());
  kalman_joystick =new KalmanFilter_1st_order(0.1f);
  kalman_2nd_order = new KalmanFilter_2nd_order(loadcell->getVarianceEstimate());


  // LED signal 
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0, 0x80, 0x00, 0x80);//purple
      pixels.show(); 
      //delay(3000);
  #endif

  

  // activate parameter update in first cycle
  configUpdateAvailable = true;

  // equalize pedal config for both tasks
  dap_config_st_local = global_dap_config_class.getConfig();


  // setup multi tasking
  semaphore_updateJoystick = xSemaphoreCreateMutex();
  semaphore_updatePedalStates = xSemaphoreCreateMutex();
  semaphore_updateLoadcellReading = xSemaphoreCreateMutex();

  delay(10);


  if(semaphore_updateJoystick==NULL)
  {
    Serial.println("Could not create semaphore");
    ESP.restart();
  }


  // disableCore0WDT();
  // disableCore1WDT();

  Serial.println("Starting other tasks");

  // Register tasks
  addScheduledTask(pedalUpdateTask, "pedalUpdateTask", REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US, 2, CORE_ID_PEDAL_UPDATE_TASK, 7000);
  addScheduledTask(serialCommunicationTaskRx, "serComRx", REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US, 1, CORE_ID_SERIAL_COMMUNICATION_TASK, 5000);
  addScheduledTask(joystickOutputTask, "joystickOutputTask", REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US, 1, CORE_ID_JOYSTICK_TASK, 5000);

  // === Replace hw_timer with esp_timer ===
  const esp_timer_create_args_t periodic_timer_args = {
    .callback = &onTimer,
    .arg = NULL,
    .name = "sched_timer"
  };

  esp_timer_handle_t periodic_timer;
  esp_timer_create(&periodic_timer_args, &periodic_timer);

  // Start periodic timer at BASE_TICK_US interval
  esp_timer_start_periodic(periodic_timer, BASE_TICK_US);


	// ADD THIS: Create the TX task as a standalone, event-driven task.
    xTaskCreatePinnedToCore(
        serialCommunicationTaskTx,      /* Task function. */
        "serComTx",    /* name of task. */
        2000,                           /* Stack size of task */
        NULL,                           /* parameter of the task */
        1,                              /* priority of the task (e.g., 2, slightly higher than producer) */
        &handle_serialCommunicationTx,  /* Task handle */
        CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */

  // xTaskCreatePinnedToCore(
  //                   serialCommunicationTaskRx,   /* Task function. */
  //                   "serialCommunicationTaskRx",          /* name of task. */
  //                   5000,                      /* Stack size of task */
  //                   NULL,                      /* parameter of the task */
  //                   2,                         /* priority of the task */
  //                   &handle_serialCommunicationRx, /* Task handle to keep track of created task */
  //                   CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */
	
  // the loadcell task does not need a dedicated timer, since it blocks by DRDY ready ISR
  xTaskCreatePinnedToCore(
                    loadcellReadingTask,   /* Task function. */
                    "loadcellReadingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    2,           /* priority of the task */
                    &handle_loadcellReadingTask,      /* Task handle to keep track of created task */
                    CORE_ID_LOADCELLREADING_TASK);          /* pin task to core 1 */  


xTaskCreatePinnedToCore(
                    profilerTask,   /* Task function. */
                    "profilerTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    10,           /* priority of the task */
                    &handle_profilerTask,      /* Task handle to keep track of created task */
                    CORE_ID_PROFILER_TASK);          /* pin task to core 1 */

  xTaskCreatePinnedToCore(
                    miscTask,   
                    "miscTask", 
                    2000,  
                    NULL,      
                    1,         
                    &handle_miscTask,    
                    CORE_ID_MISC_TASK);     


                    
 
  #ifdef SERIAL_PATTERN_DETECTOR

    // --- ADD: Create the serialCommunicationTask as a standalone task ---
  // Create the queue to hold incoming serial packets
  serial_packet_queue = xQueueCreate(10, sizeof(UartPacket_t)); // Queue can hold 10 packets


  // This prevents the "UART driver already installed" error.
  uart_driver_delete(UART_NUM_0);
  
  // --- MODIFIED: Install driver over the existing UART0 ---
  // Note: This will reconfigure the port used by the Arduino `Serial` object.
  esp_err_t err = uart_driver_install(UART_NUM_0, UART_RX_BUF_SIZE * 2, 0, 20, &uart_queue, 0);
  if (err != ESP_OK) {
    Serial.printf("Failed to install UART driver: %d\n", err);
    return;
  }

  // Configure UART parameters
  // SERIAL_8N1
  uart_config_t uart_config = {
      .baud_rate = BAUD3M,
      .data_bits = UART_DATA_8_BITS,
      .parity    = UART_PARITY_DISABLE,
      .stop_bits = UART_STOP_BITS_1,
      .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
      .source_clk = UART_SCLK_XTAL,
  };
  
