Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  // Apply the UART configuration
  uart_param_config(UART_NUM_0, &uart_config);

  // --- NEW: Enable UART pattern detection ---
  #define SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US 100
  uart_enable_pattern_det_baud_intr(UART_NUM_0, EOF_BYTE_1, 1, SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US, 0, 0);

  // Create the task that will handle UART events
  xTaskCreate(
      uart_event_task,    // Task function
      "uart_event_task",  // Name of the task
      4096,               // Stack size
      NULL,               // Task input parameter
      12,                 // Priority of the task
      NULL                // Task handle
  );

  #endif
  



  #if defined(OTA_update)  || defined(OTA_update_ESP32)
  
    switch(dap_config_st_local.payLoadPedalConfig_.pedal_type)
    {
      case 0:
        APhost=new char[strlen("FFBPedalClutch") + 1];
        strcpy(APhost, "FFBPedalClutch");
        //APhost="FFBPedalClutch";
        break;
      case 1:
        APhost=new char[strlen("FFBPedalBrake") + 1];
        strcpy(APhost, "FFBPedalBrake");
        //APhost="FFBPedalBrake";
        break;
      case 2:
        APhost=new char[strlen("FFBPedalGas") + 1];
        strcpy(APhost, "FFBPedalGas");
        //APhost="FFBPedalGas";
        break;
      default:
        APhost=new char[strlen("FFBPedal") + 1];
        strcpy(APhost, "FFBPedal");
        //APhost="FFBPedal";
        break;        

    }   
                   
    addScheduledTask(OTATask, "OTATask", REPETITION_INTERVAL_OTA_TASK_IN_US, 1, CORE_ID_OTA_TASK, 16000);

    delay(200);
  #endif

  //MCP setup
  #ifdef Using_analog_output_ESP32_S3
    //Wire.begin(MCP_SDA,MCP_SCL,400000);
    MCP4725_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4725_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4725_I2C.endTransmission();
      if (error == 0)
      {
        Serial.print("I2C device found at address");
        Serial.print(i2c_address[index_address]);
        Serial.println("  !");
        found_address=index_address;
        break;
        
      }
      else
      {
        Serial.print("try address");
        Serial.println(i2c_address[index_address]);
      }
    }
    
    if(dac.begin(i2c_address[found_address], &MCP4725_I2C)==false)
    {
      Serial.println("Couldn't find MCP, will not have analog output");
      MCP_status=false;
    }
    else
    {
      Serial.println("MCP founded");
      MCP_status=true;
      //MCP.begin();
    }
  #endif

  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
      pixels.show(); 
      //delay(3000);
  #endif

  //print pedal role assignment
  if(dap_config_st_local.payLoadPedalConfig_.pedal_type!=4)
  {
    Serial.print("Pedal Assignment: ");
    Serial.println(dap_config_st_local.payLoadPedalConfig_.pedal_type);
  }
  else
  {
    #ifdef PEDAL_HARDWARE_ASSIGNMENT
      Serial.println("Pedal Role Assignment:4, reading from CFG pins....");
    #else
      Serial.println("Pedal Role Assignment:4, Role assignment Error, Please send the config in to finish role assignment.");
    #endif
  }
  
  #ifdef PEDAL_HARDWARE_ASSIGNMENT
    pinMode(CFG1, INPUT_PULLUP);
    pinMode(CFG2, INPUT_PULLUP);
    delay(50); // give the pin time to settle
    Serial.println("Overriding Pedal Role Assignment from Hardware switch......");
    uint8_t CFG1_reading=digitalRead(CFG1);
    uint8_t CFG2_reading=digitalRead(CFG2);
    uint8_t Pedal_assignment=CFG1_reading*2+CFG2_reading*1;//00=clutch 01=brk  02=gas
    if(Pedal_assignment==3)
    {
      Serial.println("Pedal Type:3, assignment error, please adjust dip switch on control board to finish role assignment.");
    }
    else
    {
      if(Pedal_assignment!=4)
        {
          //Serial.print("Pedal Type");
          //Serial.println(Pedal_assignment);
          if(Pedal_assignment==0)
          {
            Serial.println("Overriding Pedal as Clutch.");
          }
          if(Pedal_assignment==1)
          {
            Serial.println("Overriding Pedal as Brake.");
          }
          if(Pedal_assignment==2)
          {
            Serial.println("Overriding Pedal as Throttle.");
          }
          DAP_config_st tmp = global_dap_config_class.getConfig();
          tmp.payLoadPedalConfig_.pedal_type = Pedal_assignment;
          dap_config_st_local.payLoadPedalConfig_.pedal_type = Pedal_assignment;
          global_dap_config_class.setConfig(tmp);

        }
        else
        {
          Serial.println("Asssignment error, defective pin connection, pelase connect USB and send a config to finish assignment");
        }
    }
   
  #endif

  //enable ESP-NOW
  #ifdef ESPNOW_Enable
  dap_calculationVariables_st.rudder_brake_status=false;
  if(dap_config_st_local.payLoadPedalConfig_.pedal_type==0||dap_config_st_local.payLoadPedalConfig_.pedal_type==1||dap_config_st_local.payLoadPedalConfig_.pedal_type==2)
  {
    Serial.println("Starting ESP now tasks");
    ESPNow_initialize();
    Serial.println("ESPNOW initialized, add task in");
    // xTaskCreatePinnedToCore(
    //                     ESPNOW_SyncTask,   
    //                     "ESPNOW_update_Task", 
    //                     10000,  
    //                     //STACK_SIZE_FOR_TASK_2,    
    //                     NULL,      
    //                     1,         
    //                     &handle_espnowTask,    
    //                     CORE_ID_ESPNOW_TASK);  
                        
    addScheduledTask(ESPNOW_SyncTask, "ESPNOW_update_Task", REPETITION_INTERVAL_ESPNOW_TASK_IN_US, 1, CORE_ID_ESPNOW_TASK, 10000);
    Serial.println("ESPNOW task added");
    delay(500);
  }
  else
  {
    Serial.println("ESPNOW task did not started due to Assignment error, please usb connect to Simhub and finish Assignment.");
  }
  #endif
  Serial.println("Setup Controller");
  #ifdef CONTROLLER_SPECIFIC_VIDPID
    SetupController_USB(dap_config_st_local.payLoadPedalConfig_.pedal_type);
    delay(500);
  #endif  
  #ifndef CONTROLLER_SPECIFIC_VIDPID
  // init controller
  #if defined(BLUETOOTH_GAMEPAD) || defined(USB_JOYSTICK)
  SetupController();
  #endif
  //delay(3000);
  #endif




  



