Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                      }
                      if(i==1)
                      {
                        ESPNow.remove_peer(Brk_mac);
                        memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Brk_mac);
                      }
                      if(i==2)
                      {
                        ESPNow.remove_peer(Gas_mac);
                        memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Gas_mac);
                      }        
                      if(i==3)
                      {
                        ESPNow.remove_peer(esp_Host);
                        memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(esp_Host);                
                      }        
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==1)
                      {
                        Recv_mac=Gas_mac;
                      }
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==2)
                      {
                        Recv_mac=Brk_mac;
                      }
                    }
                  }
                }
              }
            }
          #endif

          profiler_espNow.start(1);

          //joystick value broadcast
          /*
          if((joystickPacketsUpdateLast-millis())>joystickPacketInterval) 
          {
            ESPNow_Joystick_Broadcast(joystickNormalizedToInt32);
            joystickPacketsUpdateLast=millis();
          }
          */
          
          profiler_espNow.end(1);

          profiler_espNow.start(2);

          if(basic_state_send_b)
          {
            // update pedal states
            DAP_state_basic_st dap_state_basic_st_lcl;       
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE basic pedal state struct
                dap_state_basic_st_lcl = dap_state_basic_st;

                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_basic_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl.payLoadHeader_)), sizeof(dap_state_basic_st_lcl.payLoadHeader_) + sizeof(dap_state_basic_st_lcl.payloadPedalState_Basic_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }
            ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st_lcl,sizeof(dap_state_basic_st_lcl));
            basic_state_send_b=false;
          }

          profiler_espNow.end(2);

          profiler_espNow.start(3);

          if(extend_state_send_b)
          {
            // update pedal states
            DAP_state_extended_st dap_state_extended_st_espNow; 
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_extended_st_espNow, 0, sizeof(dap_state_extended_st_espNow));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE extended pedal state struct
                dap_state_extended_st_espNow = dap_state_extended_st; 
                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_extended_st_espNow.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_espNow.payLoadHeader_)), sizeof(dap_state_extended_st_espNow.payLoadHeader_) + sizeof(dap_state_extended_st_espNow.payloadPedalState_Extended_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }

            ESPNow.send_message(broadcast_mac,(uint8_t *)&dap_state_extended_st_espNow, sizeof(dap_state_extended_st_espNow));
            extend_state_send_b=false;
          }

          profiler_espNow.end(3);


          if(ESPNow_config_request)
          {
            DAP_config_st * dap_config_st_local_ptr;
            dap_config_st_local_ptr = &espnow_dap_config_st;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
            uint16_t crc=0;
            crc = checksumCalculator((uint8_t*)(&(espnow_dap_config_st.payLoadHeader_)), sizeof(espnow_dap_config_st.payLoadHeader_) + sizeof(espnow_dap_config_st.payLoadPedalConfig_));
            dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
            ESPNow.send_message(broadcast_mac,(uint8_t *) & espnow_dap_config_st, sizeof(espnow_dap_config_st));
            ESPNow_config_request=false;
          }


          if(ESPNow_OTA_enable)
          {
            Serial.println("Get OTA command");
            
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
          }


          if(OTA_update_action_b)
          {
            Serial.println("Get OTA command");
            #ifdef USING_BUZZER
              buzzerBeepAction_b=true;
            #endif
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
            //Serial.println("get basic wifi info");
            //Serial.readBytes((char*)&dap_action_ota_st, sizeof(DAP_action_ota_st));
            #ifdef OTA_update

              if(dap_action_ota_st.payLoadHeader_.payloadType==DAP_PAYLOAD_TYPE_ACTION_OTA)
              {
                if(dap_action_ota_st.payloadOtaInfo_.device_ID == espnow_dap_config_st.payLoadPedalConfig_.pedal_type)
                {
                  SSID=new char[dap_action_ota_st.payloadOtaInfo_.SSID_Length+1];
                  PASS=new char[dap_action_ota_st.payloadOtaInfo_.PASS_Length+1];
                  memcpy(SSID,dap_action_ota_st.payloadOtaInfo_.WIFI_SSID,dap_action_ota_st.payloadOtaInfo_.SSID_Length);
                  memcpy(PASS,dap_action_ota_st.payloadOtaInfo_.WIFI_PASS,dap_action_ota_st.payloadOtaInfo_.PASS_Length);
                  SSID[dap_action_ota_st.payloadOtaInfo_.SSID_Length]=0;
                  PASS[dap_action_ota_st.payloadOtaInfo_.PASS_Length]=0;
                  OTA_enable_b=true;
                }
              }

            #endif

